src/InformationRegisters/АналогиНормРасходов/АналогиНормРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНормРасходов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Норма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НормыРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналогНормыРасходов</name>
    <type>
      <types>CatalogRef.АналогиНормРасходов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИзвещенияОбИзменениях/ИзвещенияОбИзменениях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИзвещенияОбИзменениях</name>
  <dimensions>
    <name>Элемент</name>
    <type>
      <types>CatalogRef.ТехОснастка</types>
      <types>CatalogRef.Документация</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ТехОперации</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Извещение</name>
    <type>
      <types>CatalogRef.ИзвещенияОбИзменениях</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonForms/КопироватьПеренестиВ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
НаДату = ТекущаяДата();
ДатаИзменения = ТекущаяДата();
Спецификация = ЭтаФорма.Параметры.ИсходнаяСпецификация;
	Для к = 0 По ЭтаФорма.Параметры.СписокМПЗ.ВГраница() Цикл
	НР = ЭтаФорма.Параметры.СписокМПЗ[к];
	СписокМПЗ.Добавить(ЭтаФорма.Параметры.СписокМПЗ[к],СокрЛП(НР.Позиция)+Символы.Таб+НР);	
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция КопироватьПеренестиНаСервере(Копировать)
	Если ДатаИзменения = НачалоДня(ТекущаяДата()) Тогда
	ДатаИзм = ТекущаяДата();
	Иначе	
	ДатаИзм = ДатаИзменения;	
	КонецЕсли;
	Попытка
	НачатьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция + 1;
		Для каждого МПЗ Из СписокМПЗ Цикл
		НР = МПЗ.Значение;
		НоваяНР = НР.Скопировать();
		НоваяНР.Владелец = Спецификация;
		НоваяНР.Позиция = НР.Позиция;
		НоваяНР.Записать();
		Нормы = РегистрыСведений.НормыРасходов.ПолучитьПоследнее(КонецДня(НаДату),Новый Структура("НормаРасходов",НР));
		РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
		РНР.Период = ДатаИзм;
		РНР.Владелец = НоваяНР.Владелец; 
		РНР.Элемент = НоваяНР.Элемент;
		РНР.НормаРасходов = НоваяНР.Ссылка;
		РНР.Норма = Нормы.Норма;
		РНР.Записать();
			Если САналогами Тогда
			Запрос = Новый Запрос;

			Запрос.Текст = 
				"ВЫБРАТЬ
				|	АналогиНормРасходов.Ссылка КАК Ссылка,
				|	АналогиНормРасходовСрезПоследних.Норма КАК Норма
				|ИЗ
				|	Справочник.АналогиНормРасходов КАК АналогиНормРасходов
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналогиНормРасходов.СрезПоследних(&НаДату, ) КАК АналогиНормРасходовСрезПоследних
				|		ПО АналогиНормРасходов.Ссылка = АналогиНормРасходовСрезПоследних.АналогНормыРасходов
				|ГДЕ
				|	АналогиНормРасходов.Владелец = &Владелец
				|	И АналогиНормРасходов.ПометкаУдаления = ЛОЖЬ
				|	И АналогиНормРасходовСрезПоследних.Норма > 0";
			Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
			Запрос.УстановитьПараметр("Владелец", НР);
			РезультатЗапроса = Запрос.Выполнить();
			ВыборкаАНР = РезультатЗапроса.Выбрать();
				Пока ВыборкаАНР.Следующий() Цикл
				НоваяАНР = ВыборкаАНР.Ссылка.Скопировать();
				НоваяАНР.Владелец = НоваяНР.Ссылка;
				НоваяАНР.Записать();
				РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
				РАНР.Период = ДатаИзм;
				РАНР.Владелец = НоваяАНР.Владелец;
				РАНР.АналогНормыРасходов = НоваяАНР.Ссылка;
				РАНР.Норма = ВыборкаАНР.Норма;
				РАНР.Записать();
					Если Не Копировать Тогда
					РАНР = РегистрыСведений.АналогиНормРасходов.СоздатьМенеджерЗаписи();
					РАНР.Период = ДатаИзм;
					РАНР.Владелец = ВыборкаАНР.Ссылка.Владелец;
					РАНР.АналогНормыРасходов = ВыборкаАНР.Ссылка;
					РАНР.Норма = 0;
					РАНР.Записать();
					КонецЕсли; 		
			    КонецЦикла;
			КонецЕсли; 
				Если Не Копировать Тогда
				РНР = РегистрыСведений.НормыРасходов.СоздатьМенеджерЗаписи();
				РНР.Период = ДатаИзм;
				РНР.Владелец = НР.Владелец; 
				РНР.Элемент = НР.Элемент;
				РНР.НормаРасходов = НР;
				РНР.Норма = 0;
				РНР.Записать();		
				КонецЕсли; 
		КонецЦикла;
			Если Не Извещение.Пустая() Тогда
			Извещение = РегистрыСведений.ИзвещенияОбИзменениях.СоздатьМенеджерЗаписи();
		    Извещение.Период = ДатаИзм;
			Извещение.Элемент = Параметры.ИсходнаяСпецификация;
			Извещение.Извещение = Извещение;
			Извещение.Записать();
			КонецЕсли; 
	ЗафиксироватьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;Если ПараметрыСеанса.АктивнаТранзакция = 0 тогда СРМ_ОбменВебСервис.ОтправкаПослеТранзакции();КонецЕсли;
	Исключение
	Сообщить(ОписаниеОшибки());
	ОтменитьТранзакцию();ПараметрыСеанса.АктивнаТранзакция = ПараметрыСеанса.АктивнаТранзакция-1;ПараметрыСеанса.ОбъектыСозданныеВТранзакции = Новый ХранилищеЗначения(Новый Массив);
	Возврат(Ложь);
	КонецПопытки;
Возврат(Истина);
КонецФункции

&НаКлиенте
Процедура Копировать(Команда)
	Если Спецификация <> ЭтаФорма.Параметры.ИсходнаяСпецификация Тогда
		Если КопироватьПеренестиНаСервере(Истина) Тогда
		ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	Иначе
	Сообщить("Выберите этап спецификации отличный от исходного!");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	Если Спецификация <> ЭтаФорма.Параметры.ИсходнаяСпецификация Тогда
		Если КопироватьПеренестиНаСервере(Ложь) Тогда
		ЭтаФорма.Закрыть(Истина);
		КонецЕсли;
	Иначе
	Сообщить("Выберите этап спецификации отличный от исходного!");	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
ЭтаФорма.Закрыть(Неопределено);
КонецПроцедуры
